pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.h
//---------------------------------------------------------------------------*
//                                                                           *
//                      File 'pic18_optimize_block.h'                        *
//                        Generated by version 2.5.0                         *
//                      august 3rd, 2013, at 11h26'5"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_optimize_block_ENTITIES_DEFINED
#define pic18_optimize_block_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "ipic18_block_representation.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "pic18_mnemonics.h"

//---------------------------------------------------------------------------*

class GALGAS_symbolTableForBlockOptimization ;
class GALGAS_symbolTableForBlockOptimization_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   @symbolTableForBlockOptimization map                    *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_symbolTableForBlockOptimization ;

//---------------------------------------------------------------------------*

extern const char * kSearchErrorMessage_symbolTableForBlockOptimization_searchKey ;

//---------------------------------------------------------------------------*

class GALGAS_symbolTableForBlockOptimization : public AC_GALGAS_map {
//--------------------------------- Default constructor
  public : GALGAS_symbolTableForBlockOptimization (void) ;

//--------------------------------- Handle copy
  public : GALGAS_symbolTableForBlockOptimization (const GALGAS_symbolTableForBlockOptimization & inSource) ;
  public : GALGAS_symbolTableForBlockOptimization & operator = (const GALGAS_symbolTableForBlockOptimization & inSource) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_symbolTableForBlockOptimization extractObject (const GALGAS_object & inObject,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_symbolTableForBlockOptimization constructor_emptyMap (LOCATION_ARGS) ;

  public : static GALGAS_symbolTableForBlockOptimization constructor_mapWithMapToOverride (const GALGAS_symbolTableForBlockOptimization & inOperand0
                                                                                           COMMA_LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertKey (GALGAS_lstring constinArgument0,
                                                     GALGAS_uint constinArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_removeKey (GALGAS_lstring constinArgument0,
                                                     GALGAS_uint & outArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMDefinitionBlockIndexForKey (GALGAS_uint constinArgument0,
                                                                          GALGAS_string constinArgument1,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_searchKey (GALGAS_lstring constinArgument0,
                                                   GALGAS_uint & outArgument1,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mDefinitionBlockIndexForKey (const GALGAS_string & constinOperand0,
                                                                            C_Compiler * inCompiler
                                                                            COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_symbolTableForBlockOptimization reader_overriddenMap (C_Compiler * inCompiler
                                                                                         COMMA_LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- 'with' accessors
  public : VIRTUAL_IN_DEBUG cMapElement_symbolTableForBlockOptimization * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                                    const GALGAS_string & inKey
                                                                                                                    COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG cMapElement_symbolTableForBlockOptimization * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                                       const GALGAS_lstring & inKey
                                                                                                                       COMMA_LOCATION_ARGS) ;

//--------------------------------- Friend

  friend class cEnumerator_symbolTableForBlockOptimization ;
 
