pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.h
} ; // End of GALGAS_symbolTableForBlockOptimization class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_symbolTableForBlockOptimization : public cGenericAbstractEnumerator {
  public : cEnumerator_symbolTableForBlockOptimization (const GALGAS_symbolTableForBlockOptimization & inEnumeratedObject,
                                                        const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_lstring current_lkey (LOCATION_ARGS) const ;
  public : GALGAS_uint current_mDefinitionBlockIndex (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_symbolTableForBlockOptimization_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_symbolTableForBlockOptimization ;

//--------------------------------- 'with' accessors
cCollectionElement * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                               GALGAS_symbolTableForBlockOptimization & ioMap,
                                                               GALGAS_string & inKey
                                                               COMMA_LOCATION_ARGS) ;

cCollectionElement * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                  GALGAS_symbolTableForBlockOptimization & ioMap,
                                                                  GALGAS_lstring & inKey
                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'ipic18OptimizeBlocks'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_ipic_31__38_OptimizeBlocks (GALGAS_string & ioArgument0,
                                         GALGAS_ipic_31__38_BlockList & ioArgument1,
                                         C_Compiler * inCompiler
                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Abstract category method '@ipic18AbstractBlockTerminator display'     *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_display) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                     GALGAS_string & ioArgument0,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_display (const PMSInt32 inClassIndex,
                                  categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_display inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                 GALGAS_string & io_ioListFileContents,
                                 C_Compiler * inCompiler
                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@ipic18AbstractBlockTerminator optimizeTerminator'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_optimizeTerminator) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                const GALGAS_symbolTableForBlockOptimization constinArgument0,
                                                                                                const GALGAS_ipic_31__38_BlockList constinArgument1,
                                                                                                const GALGAS_string constinArgument2,
                                                                                                GALGAS_bool & ioArgument3,
                                                                                                GALGAS_string & ioArgument4,
                                                                                                GALGAS_ipic_31__38_AbstractBlockTerminator & outArgument5,
                                                                                                C_Compiler * inCompiler
                                                                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeTerminator (const PMSInt32 inClassIndex,
                                             categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_optimizeTerminator inMethod) ;

//---------------------------------------------------------------------------*

