pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.h
void callCategoryMethod_optimizeTerminator (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                            const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                                            const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                                            const GALGAS_string constin_inBlockLabel,
                                            GALGAS_bool & io_ioOptimizationDone,
                                            GALGAS_string & io_ioListFileContents,
                                            GALGAS_ipic_31__38_AbstractBlockTerminator & out_outOptimizedTerminator,
                                            C_Compiler * inCompiler
                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18AbstractConditionTerminator getOptimizedTerminators'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators) (const cPtr_ipic_31__38_AbstractConditionTerminator * inObject,
                                                                                                         const GALGAS_symbolTableForBlockOptimization constinArgument0,
                                                                                                         const GALGAS_ipic_31__38_BlockList constinArgument1,
                                                                                                         const GALGAS_string constinArgument2,
                                                                                                         GALGAS_bool & ioArgument3,
                                                                                                         GALGAS_string & ioArgument4,
                                                                                                         GALGAS_ipic_31__38_SingleInstructionTerminator & outArgument5,
                                                                                                         GALGAS_ipic_31__38_SingleInstructionTerminator & outArgument6,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getOptimizedTerminators (const PMSInt32 inClassIndex,
                                                  categoryMethodSignature_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_getOptimizedTerminators (const cPtr_ipic_31__38_AbstractConditionTerminator * inObject,
                                                 const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                                                 const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                                                 const GALGAS_string constin_inBlockLabel,
                                                 GALGAS_bool & io_ioOptimizationDone,
                                                 GALGAS_string & io_ioListFileContents,
                                                 GALGAS_ipic_31__38_SingleInstructionTerminator & out_outOptimizedTrueTerminator,
                                                 GALGAS_ipic_31__38_SingleInstructionTerminator & out_outOptimizedFalseTerminator,
                                                 C_Compiler * inCompiler
                                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@ipic18AbstractBlockTerminator enterTerminatorReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_enterTerminatorReferencedLabels) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                             GALGAS_stringset & ioArgument0,
                                                                                                             C_Compiler * inCompiler
                                                                                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterTerminatorReferencedLabels (const PMSInt32 inClassIndex,
                                                          categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_enterTerminatorReferencedLabels inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_enterTerminatorReferencedLabels (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                         GALGAS_stringset & io_ioReferencedBlockSet,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstruction enterInstructionReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_SequentialInstruction_enterInstructionReferencedLabels) (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                                                                            GALGAS_stringset & ioArgument0,
                                                                                                            C_Compiler * inCompiler
                                                                                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterInstructionReferencedLabels (const PMSInt32 inClassIndex,
                                                           categoryMethodSignature_ipic_31__38_SequentialInstruction_enterInstructionReferencedLabels inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_enterInstructionReferencedLabels (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                          GALGAS_stringset & io_ioReferencedBlockSet,
                                                          C_Compiler * inCompiler
                                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstructionList enterInstructionReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_enterInstructionReferencedLabels (const GALGAS_ipic_31__38_SequentialInstructionList inObject,
                                                      GALGAS_stringset & io_ioReferencedBlockSet,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//           Category method '@ipic18Block enterReferencedLabels'            *
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_enterReferencedLabels (const GALGAS_ipic_31__38_Block inObject,
                                           GALGAS_stringset & io_ioReferencedBlockSet,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                  Category method '@ipic18Block optimize'                  *
//                                                                           *
//---------------------------------------------------------------------------*

