pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.h
void categoryMethod_optimize (const GALGAS_ipic_31__38_Block inObject,
                              const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                              const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                              GALGAS_bool & io_ioOptimizationDone,
                              GALGAS_string & io_ioListFileContents,
                              GALGAS_ipic_31__38_Block & out_outOptimizedBlock,
                              C_Compiler * inCompiler
                              COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//            @symbolTableForBlockOptimization_2E_element struct             *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_symbolTableForBlockOptimization_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;
  public : GALGAS_uint mAttribute_mDefinitionBlockIndex ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_symbolTableForBlockOptimization_2E_element constructor_default (LOCATION_ARGS) ;

//--------------------------------- Default constructor
  public : GALGAS_symbolTableForBlockOptimization_2E_element (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_symbolTableForBlockOptimization_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_symbolTableForBlockOptimization_2E_element (const GALGAS_lstring & in_lkey,
                                                              const GALGAS_uint & in_mDefinitionBlockIndex) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_symbolTableForBlockOptimization_2E_element extractObject (const GALGAS_object & inObject,
                                                                                   C_Compiler * inCompiler
                                                                                   COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_symbolTableForBlockOptimization_2E_element constructor_new (const GALGAS_lstring & inOperand0,
                                                                                     const GALGAS_uint & inOperand1
                                                                                     COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_symbolTableForBlockOptimization_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mDefinitionBlockIndex (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_symbolTableForBlockOptimization_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_symbolTableForBlockOptimization_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//        Class for element of '@symbolTableForBlockOptimization' map        *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_symbolTableForBlockOptimization : public cMapElement {
//--- Map attributes
  public : GALGAS_uint mAttribute_mDefinitionBlockIndex ;

//--- Constructor
  public : cMapElement_symbolTableForBlockOptimization (const GALGAS_lstring & inKey,
                                                        const GALGAS_uint & in_mDefinitionBlockIndex
                                                        COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
